app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `authorname`, `story`, `category`, `created_at`, `updated_at`) VALUES ('HTML Color Picker', 'siva', 'Here is the next assignment on adding Bootstrap to your rails application.\r\n\r\nFind the attached screen-shots for your reference for creating views. I want you to achieve these views with help of bootstrap.\r\n\r\nArticle should contains following fields.\r\n1. Category(select box)\r\n2. Name(text box)\r\n3. Description(text area)\r\n4. Is published(check box)\r\n5. Upload Image(file upload)\r\n', 'Sports', '2018-11-28 10:30:58', '2018-11-28 10:30:58')
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `story` = 'cricket is the game.Sachin is God of cricket', `updated_at` = '2018-11-27 11:30:47' WHERE `articles`.`id` = 6
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)